app/views/chat_messages/_chat_message.html.erb

SELECT "mentions".* FROM "mentions" WHERE "mentions"."chat_message_id" IN ($1, $2, $3)  [["chat_message_id", 980190963], ["chat_message_id", 298486374], ["chat_message_id", 980190962]]
---
  id="<%= dom_id(chat_message) %>"
  class="chat-message <%= "mention" if chat_message.mentions.any? { |mention| mention.user_id == current_user.id } %>"

INSERT INTO "chat_messages" ("body", "created_at", "message_type", "metadata", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Hello @chatter"], ["created_at", "2026-01-02 20:06:37.099659"], ["message_type", 0], ["metadata", "{}"], ["updated_at", "2026-01-02 20:06:37.099659"], ["user_id", 980190963]]
---
  <div class="chat-line">
    <span class="chat-time muted">[<%= chat_message.created_at.strftime("%H:%M") %>]</span>