app/views/posts/index.html.erb

          </div>
          <% if post.tags.any? %>
---
SELECT "tags".* FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = $1  [["post_id", 980190962]]
SELECT 1 AS one FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = $1 LIMIT $2  [["post_id", 980190962], ["LIMIT", 1]]