app/views/posts/show.html.erb


  <% if @post.tags.any? %>
---
SELECT 1 AS one FROM "tags" INNER JOIN "post_tags" ON "tags"."id" = "post_tags"."tag_id" WHERE "post_tags"."post_id" = $1 LIMIT $2  [["post_id", 980190963], ["LIMIT", 1]]