app/controllers/campfires_controller.rb

SELECT "campfire_rooms".* FROM "campfire_rooms" WHERE "campfire_rooms"."id" = $1 LIMIT $2  [["id", 980190963], ["LIMIT", 1]]
---
  def voice_token
    room = CampfireRoom.find(params[:id])