app/controllers/chat_messages_controller.rb

INSERT INTO "chat_messages" ("body", "created_at", "message_type", "metadata", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "Hello @chatter"], ["created_at", "2026-01-02 20:06:37.099659"], ["message_type", 0], ["metadata", "{}"], ["updated_at", "2026-01-02 20:06:37.099659"], ["user_id", 980190963]]
---
  def create
    body = params.require(:chat_message).fetch(:body, "").to_s.strip
    if body.blank?
      respond_blank_message
      return
    end
    if body.start_with?("/")
      handle_command(body)
      respond_after_submit
      return
    end

    @message = current_user.chat_messages.build(body: body, message_type: :regular)
    if @message.save

SELECT "chat_messages".* FROM "chat_messages" ORDER BY "chat_messages"."created_at" DESC LIMIT $1  [["LIMIT", 200]]
SELECT "chat_reactions".* FROM "chat_reactions" WHERE "chat_reactions"."chat_message_id" IN ($1, $2, $3)  [["chat_message_id", 980190963], ["chat_message_id", 298486374], ["chat_message_id", 980190962]]
SELECT "mentions".* FROM "mentions" WHERE "mentions"."chat_message_id" IN ($1, $2, $3)  [["chat_message_id", 980190963], ["chat_message_id", 298486374], ["chat_message_id", 980190962]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 980190963], ["id", 298486374], ["id", 980190962]]
---
  def load_chat_content
    @message = ChatMessage.new
    @messages = ChatMessage.includes(:user, :chat_reactions, :mentions).order(created_at: :desc).limit(200).reverse