app/controllers/magic_links_controller.rb

SELECT "users".* FROM "users" WHERE "users"."magic_link_token" = $1 LIMIT $2  [["magic_link_token", "[FILTERED]"], ["LIMIT", 1]]
UPDATE "users" SET "magic_link_expires_at" = $1, "magic_link_sent_at" = $2, "magic_link_token" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["magic_link_expires_at", nil], ["magic_link_sent_at", nil], ["magic_link_token", "[FILTERED]"], ["updated_at", "2026-01-02 20:06:37.038564"], ["id", 980190963]]
---
  def show
    user = User.find_by(magic_link_token: params[:token])

    if user&.magic_link_valid?(params[:token])
      reset_session
      session[:user_id] = user.id
      user.update!(last_signed_in_at: Time.current)