app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = $1 LIMIT $2  [["slug", "first-signal"], ["LIMIT", 1]]
---
  def show
    @post = if current_user&.admin?
      Post.find_by!(slug: params[:id])