app/controllers/signups_controller.rb

  def new
    @invite = Invite.find_by(token: params[:token])
---
SELECT "invites".* FROM "invites" WHERE "invites"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]

  def create
    @invite = Invite.find_by(token: params[:token])
    unless @invite&.usable?
      redirect_to new_session_path, alert: "Invite invalid or expired."
      return
    end

    @user = User.new(email: @invite.email, role: @invite.role)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "handle", "last_signed_in_at", "magic_link_expires_at", "magic_link_sent_at", "magic_link_token", "mic_mode", "role", "status_expires_at", "status_message", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"